const messages = {
    en: {

        //header

        busTicketBookingSystem : 'Bus Ticket Booking System',
        english : 'English',
        tamil : 'Tamil',
        kannada : 'Kannada',
        india : 'India 🇮🇳',
        malayalam : 'Malayalam',


        //Login Page Names

        makeYourJourneyPleasant: 'Make your journey Pleasant',
        downloadOurAppForBetterExperience : 'Download Our App for better experience',
        aPackagedTourToTheKanniyakumariToKashmir : 'A packaged tour to the Kanniyakumari to Kashmir',
        bookATicketsNow : 'Book a tickets now',
        aLimitedSeatsAreAvailable : 'A limited seats are available.',
        adminLogin : 'Admin Login',
        userLogin : 'User Login',
        userNameOrEmailPlaceholder : 'UserName or Email',
        passwordPlaceHolder : 'Password',
        signIn : 'Sign In',
        trendingOffers : 'Trending Offers',

        //Admin Login Bus List Names

        listOfBus : 'List of Bus',
        toAddNewBus : 'To Add New Bus',
        travelsName : 'TravelsName',
        from : 'From',
        to : 'To',
        busType : 'Bus Type',
        availableFeatures : 'Available Features',
        fare : 'Fare',
        seat : 'Seat',
        action : 'Action',
        addBus : 'AddBus',
        logOut : 'Logout',

        // Admin Login Edit Bus

        toEditBus : 'To Edit Bus',
        EditBus : 'Edit Bus',
        back : 'Back',
        busName : 'Bus Name',
        from : 'From',
        to : 'To',
        busType : 'Bus Type',
        availableFeatures : 'Available Features',
        fare : 'Fare',
        chargingPoint : 'Charging Point',
        wirelessFidelity : 'Wireless Fidelity',
        dvd : '4k DVD',
        television : 'Television',
        waterBottle : 'Water Bottle',
        pillow : 'Pillow',
        readingLight : 'Reading Light',

        //search bus ui

        indiasNo1OnlineBusticketBookingSite : 'India,s No.1 Online Bus ticket Booking Site',
        bookYourTicketsNow : 'Book Your Tickets Now!',
        from : 'From',
        to : 'To',
        departureDate : 'Departure Date',
        popularRoute : 'Popular Route',
        chennaiToBangalore : 'Chennai - Bengaluru',
        chennaiToDelhi : 'Chennai - Delhi',
        chennaiToMumbai : 'Chennai - Mumbai',
        chennaiToKolkata : 'Chennai - Kolkata',
        chennaiToKochin : 'Chennai - Kochin',
        searchBus : 'Search For Bus',

        //filtered search bus ui

        availableBusses : 'Available Bus',
        theResultOfYourJourney : 'The result of your journey',
        filter : 'Filters',
        busType : 'Bus Type',
        availablitySeats : 'Available Seat',
        travelsName : 'TravelsName',
        from : 'From',
        to : 'To',
        busType : 'Bus Type',
        availableFeatures : 'Available Features',
        fare : 'Fare',
        seat : 'Seat',
        action : 'Action',
        modify : 'Modify',
        general : 'General',
        acSleeper : 'AC Sleeper',
        acSeater : 'AC Seater',
        priceRange : 'Price Range',
        back : 'Back',
        sorryForThisRoute : 'Sorry No busses available in this route...',

        //Passenger Details

        addPassenger : 'Add Passenger',
        passenger : 'Passenger',
        pleaseSelectOneSeat : 'Please select one seat',
        booked : 'Booked',
        available : 'Available',
        driver : 'driver',
        back : 'Back',
        name : 'Name',
        age : 'Age',
        gender : 'Gender',
        mobileNumber : 'Mobile Number',
        bookNow : 'BookNow',
        male : 'Male',
        female : 'Female',
        transgender : 'Transgender',

        //Payment

        payment : 'Payment',
        amount : 'Amount',
        gst : 'Gst',
        applyCouponCode : 'Apply Coupon Code',
        totalAmountNeedToPay : 'Total Amount Need To Pay',
        paymentType : 'Payment Type',
        oneLineParaPayment : '* In case if the transaction fails, mandate will be released within 30 minutes of transaction else you may reach us on support@autope.in',
        bookTicket : 'BookTicket',
        creditCard : 'CreditCard',
        debitCard : 'DebitCard',
        creditCardDetails : 'Credit Card Details',
        cardHolderName : 'Card Holder Name',
        cardNumber : 'Card Number',
        monthAndYear : 'Month And Year',
        cvv : 'Cvv',
        upiDetails : 'UPI Details',
        upi : 'Upi',

        //footer

        about : 'About',
        getInTouch : 'Get in Touch',
        address : '8014 Edith Blvd NE, Albuquerque, New York, United States',
        learnMore : 'Learn More',
        about : 'About',
        contact : 'Contact',
        advertise : 'Advertise',
        termsOfService : 'Terms of Service',
        privacyPolicy : 'Privacy Policy',
        ourNewsletter : 'Our Newsletter',
        subscribeMessage : 'Subscribe to our newsletter to get our news & discounts delivered to you.',
        subscribe : 'Subscribe',
        allRightsAreReserved : '2024. All Rights Reserved.',

    },
    ta: {

        //header

        busTicketBookingSystem : 'பேருந்து டிக்கெட் முன்பதிவு இணையதளம்',
        tamil : 'தமிழ்',
        english : 'English',
        kannada : 'Kannada',
        malayalam : 'Malayalam',
        india : 'இந்தியா 🇮🇳',

        //Login Page Names

        makeYourJourneyPleasant: 'உங்கள் பயணத்தை இனிமையாக்குங்கள்',
        downloadOurAppForBetterExperience: 'சிறந்த அனுபவத்திற்கு எங்கள் பயன்பாட்டைப் பதிவிறக்கவும்',
        aPackagedTourToTheKanniyakumariToKashmir : 'கன்னியாகுமரி முதல் காஷ்மீர் வரை ஒரு பேக்கேஜ் டூர்',
        bookATicketsNow : 'இப்போதே டிக்கெட்டுகளை முன்பதிவு செய்யுங்கள்',
        aLimitedSeatsAreAvailable : 'வரையறுக்கப்பட்ட இருக்கைகள் உள்ளன.',
        adminLogin : 'நிர்வாக உள்நுழைவு',
        userLogin : 'பயனர் உள்நுழைவு',
        userNameOrEmailPlaceholder : 'பயனர் பெயர் அல்லது மின்னஞ்சல்',
        passwordPlaceHolder : 'கடவுச்சொல்',
        signIn : 'உள்நுழைக',
        trendingOffers : 'பிரபலமான சலுகைகள்',

        //Admin Login Bus List Names

        listOfBus : 'பேருந்து பட்டியல்',
        toAddNewBus : 'புதிய பேருந்து சேர்க்க',
        travelsName : 'பேருந்து பெயர்',
        from : 'புறப்படும் இடம்',
        to : 'செல்லும் இடம்',
        busType : 'பேருந்து வகை',
        availableFeatures : 'கிடைக்கும் அம்சங்கள்',
        fare : 'கட்டணம்',
        seat : 'இருக்கை',
        action : 'நடவடிக்கை',
        addBus : 'பேருந்து கூட்டு',
        logOut : 'வெளியேறு',

        //Admin Login Edit Bus

        toEditBus : 'பஸ்ஸைத் திருத்தக',
        toEditBus : 'பஸ்ஸைத் திருத்தவும்',
        back : 'பின் செல்',
        busName : 'பேருந்து பெயர்',
        from : 'புறப்படும் இடம்',
        to : 'செல்லும் இடம்',
        busType : 'பேருந்து வகை',
        availableFeatures : 'கிடைக்கும் அம்சங்கள்',
        fare : 'கட்டணம்',
        chargingPoint : 'சார்ஜிங் பாயிண்ட்',
        wirelessFidelity : 'வைஃபை வசதி',
        dvd : '4k டிஜிட்டல் வீடியோ டிஸ்க்',
        television : 'தொலைக்காட்சி',
        waterBottle : 'தண்ணீர் கேன்',
        pillow : 'தலையணை',
        readingLight : 'டார்ச் லைட்',

        //search bus ui

        indiasNo1OnlineBusticketBookingSite : 'இந்தியாவின் நம்பர்.1 ஆன்லைன் பேருந்து டிக்கெட் முன்பதிவு தளம்',
        bookYourTicketsNow : 'இப்போதே உங்கள் டிக்கெட்டுகளை முன்பதிவு செய்யுங்கள்!',
        from : 'புறப்படும் இடம்',
        to : 'சேரும் இடம்',
        departureDate : 'புறப்படும் தேதி',
        popularRoute : 'பிரபலமான பாதை',
        chennaiToBangalore : 'சென்னை - பெங்களூரு',
        chennaiToDelhi : 'சென்னை - டெல்லி',
        chennaiToMumbai : 'சென்னை - மும்பை',
        chennaiToKolkata : 'சென்னை - கொல்கத்தா',
        chennaiToKochin : 'சென்னை - கொச்சின்',
        searchBus : 'பேருந்து தேடல்',

         //filter search bus ui

        availableBusses : 'கிடைக்கும் பேருந்துகள்',
        theResultOfYourJourney : 'உங்கள் பயணத்தின் விளைவு',
        filter : 'வடிகட்டி',
        busType : 'பேருந்து வகை',
        travelsName : 'பேருந்து பெயர்',
        from : 'புறப்படும் இடம்',
        to : 'செல்லும் இடம்',
        busType : 'பேருந்து வகை',
        availableFeatures : 'கிடைக்கும் அம்சங்கள்',
        fare : 'கட்டணம்',
        seat : 'இருக்கை',
        action : 'நடவடிக்கை',
        modify : 'மாற்றியமைக்கவும்',
        general : 'பொது',
        acSleeper : 'ஏசி ஸ்லீப்பர்',
        acSeater : 'ஏசி இருக்கை',
        priceRange : 'விலை வரம்பு',
        back : 'பின் செல்',
        availablitySeats : 'கிடைக்கும் இருக்கைகள்',


        //Passenger Details

        addPassenger : 'பயணிகளைச் சேர்க்கவும்',
        passenger : 'பயணிகள்',
        pleaseSelectOneSeat : 'ஒரு இருக்கையைத் தேர்ந்தெடுக்கவும்',
        booked : 'முன்பதிவு செய்யப்பட்டது',
        available : 'கிடைக்கும்',
        driver : 'இயக்கி',
        back : 'திரும்பு',
        name : 'பெயர்',
        age : 'வயது',
        mobileNumber : 'கைபேசி எண்',
        gender : 'பாலினம்',
        bookNow : 'பதிவு',
        male : 'ஆண்',
        female : 'பெண்',
        transgender : 'திருநங்கை',

        //Payment

        payment : 'கட்டணம்',
        amount : 'தொகை',
        gst : 'ஜிஎஸ்டி',
        applyCouponCode : 'கூப்பன் குறியீட்டைப் பயன்படுத்தவும்',
        totalAmountNeedToPay : 'செலுத்த வேண்டிய மொத்தத் தொகை',
        paymentType : 'கட்டணம் வகை',
        oneLineParaPayment : 'பரிவர்த்தனை தோல்வியுற்றால், பரிவர்த்தனை முடிந்த 30 நிமிடங்களுக்குள் ஆணை வெளியிடப்படும் இல்லையெனில் நீங்கள் support@autope.in இல் எங்களைத் தொடர்பு கொள்ளலாம்',
        bookTicket : 'புக் டிக்கெட்',
        sorryForThisRoute : 'மன்னிக்கவும் இந்த வழித்தடத்தில் பேருந்துகள் இல்லை...',
        creditCard : 'கடன் அட்டை',
        debitCard : 'பற்று அட்டை',
        creditCardDetails : 'கிரெடிட் கார்டு விவரங்கள்',
        cardHolderName : 'அட்டை வைத்திருப்பவரின் பெயர்',
        cardNumber : 'அட்டை எண்',
        monthAndYear : 'மாதம் மற்றும் ஆண்டு',
        cvv : 'அட்டை சரிபார்ப்பு மதிப்பு',
        upiDetails : 'ஒருங்கிணைந்த கட்டண இடைமுகம் விவரங்கள்',
        upi : 'ஒருங்கிணைந்த கட்டண இடைமுகம் ',

        //footer
        about : 'பற்றி',
        getInTouch : 'தொடர்பில் இருங்கள்',
        learnMore : 'மேலும் அறிக',
        contact : 'தொடர்பு கொள்ளவும்',
        advertise : 'விளம்பரம்',
        termsOfService : 'சேவை விதிமுறைகள்',
        privacyPolicy : 'தனியுரிமைக் கொள்கை',
        ourNewsletter : 'எங்கள் செய்திமடல்',
        subscribeMessage : 'எங்கள் செய்திகள் மற்றும் தள்ளுபடிகள் உங்களுக்கு வழங்க எங்கள் செய்திமடலுக்கு குழுசேரவும்.',
        subscribe : 'பதிவு',
        allRightsAreReserved : '2024. அனைத்து உரிமைகளும் பாதுகாக்கப்பட்டவை',
        address : 'No:13B,!3th floor ,Tidal Park,Thiruvanmiyur,Chennai 6000018',
    },
    kn: {

        //header

        india : 'ಭಾರತ 🇮🇳',
        kannada  : 'ಕನ್ನಡ',
        english : 'English',
        tamil : 'Tamil',
        malayalam : 'Malayalam',
        busTicketBookingSystem : 'ಬಸ್ ಟಿಕೆಟ್ ಬುಕಿಂಗ್ ವೆಬ್‌ಸೈಟ್',


        //Login Page Names

        makeYourJourneyPleasant: 'ನಿಮ್ಮ ಪ್ರಯಾಣವನ್ನು ಮನಗಾಣಿಸಿ',
        downloadOurAppForBetterExperience: 'ಉತ್ತಮ ಅನುಭವಕ್ಕಾಗಿ ನಮ್ಮ ಅಪ್ಲಿಕೇಶನ್ ಅನ್ನು ಡೌನ್‌ಲೋಡ್ ಮಾಡಿ',
        aPackagedTourToTheKanniyakumariToKashmir: 'ಕನ್ಯಾಕುಮಾರಿ ನಿಂದ ಕಾಶ್ಮೀರ ವರೆಗೆ ಒಂದು ಪ್ಯಾಕೇಜ್ ಟೂರ್',
        bookATicketsNow: 'ಈಗ ಟಿಕೆಟ್‌ಗಳನ್ನು ಬುಕ್ ಮಾಡಿ',
        aLimitedSeatsAreAvailable: 'ಎರಡರ ನಡುವೆ ಮಿತಿಯಾದ ಸೀಟುಗಳು ಲಭ್ಯವಿವೆ',
        adminLogin: 'ನಿರ್ವಾಹಕ ಲಾಗಿನ್',
        userLogin: 'ಬಳಕೆದಾರ ಲಾಗಿನ್',
        userNameOrEmailPlaceholder: 'ಬಳಕೆದಾರ ಹೆಸರು ಅಥವಾ ಇಮೇಲ್',
        passwordPlaceHolder: 'ಪಾಸ್‌ವರ್ಡ್',
        signIn: 'ಸೈನ್ ಇನ್',
        trendingOffers: 'ಪ್ರಚಲಿತ ಆಫರ್‌ಗಳು',


       //Admin Login Bus List Names

        listOfBus : 'ಬಸ್ ಪಟ್ಟಿ',
        toAddNewBus : 'ಹೊಸ ಬಸ್ ಸೇರಿಸಲು',
        travelsName: 'ಪ್ರಯಾಣದ ಹೆಸರು',
        from: 'ಎಲ್ಲಿಂದ',
        to: 'ಎಲ್ಲಿಗೆ',
        busType: 'ಬಸ್ ಪ್ರಕಾರ',
        availableFeatures: 'ಲಭ್ಯವಿರುವ ವಿಶೇಷಗಳು',
        fare: 'ಶುಲ್ಕ',
        seat: 'ಸೀಟು',
        action: 'ಕ್ರಿಯೆ',
        addBus: 'ಬಸ್ ಸೇರಿಸಿ',
        logOut: 'ಲಾಗ್ ಔಟ್',

       //Admin Login Edit Bus

        toEditBus: 'ಬಸ್‌ನನ್ನು ಸಂಪಾದಿಸಲು',
        EditBus : 'ಬಸ್ ಸಂಪಾದಿಸಿ',
        back: 'ಬಸ್ ಪಟ್ಟಿಗೆ ಹಿಂತಿರುಗಿ',
        busName: 'ಬಸ್ ಹೆಸರು',
        from: 'ಎಲ್ಲಿಂದ',
        to: 'ಎಲ್ಲಿಗೆ',
        busType: 'ಬಸ್ ಪ್ರಕಾರ',
        availableFeatures: 'ಲಭ್ಯವಿರುವ ವಿಶೇಷಗಳು',
        fare: 'ಶುಲ್ಕ',
        chargingPoint : 'ಚಾರ್ಜಿಂಗ್ ಪಾಯಿಂಟ್',
        wirelessFidelity : 'ವೈರ್ಲೆಸ್ ಫಿಡಿಲಿಟಿ',
        dvd : '4 ಕೆ ಡಿಜಿಟಲ್ ವಿಡಿಯೋ ಡಿಸ್ಕ್',
        television : 'ದೂರದರ್ಶನ',
        waterBottle : 'ನೀರಿನ ಶೀಶೆ',
        pillow : 'ದಿಂಬು',
        readingLight : 'ಓದುವ ಬೆಳಕು',

        //search bus ui

        indiasNo1OnlineBusticketBookingSite: 'ಭಾರತದ ಸಂಖ್ಯೆ 1 ಆನ್‌ಲೈನ್ ಬಸ್ ಟಿಕೆಟ್ ಬುಕ್ ಮಾಡುವ ತಂತ್ರಾಂಶ',
        bookYourTicketsNow: 'ಈಗ ನಿಮ್ಮ ಟಿಕೆಟ್‌ಗಳನ್ನು ಬುಕ್ ಮಾಡಿ!',
        from: 'ಎಲ್ಲಿಂದ',
        to: 'ಎಲ್ಲಿಗೆ',
        departureDate: 'ಹೊರಟ ದಿನಾಂಕ',
        popularRoute: 'ಜನಪ್ರಿಯ ರೂಟ್',
        chennaiToBangalore: 'ಚೆನ್ನೈ - ಬೆಂಗಳೂರು',
        chennaiToDelhi: 'ಚೆನ್ನೈ - ದೆಹಲಿ',
        chennaiToMumbai: 'ಚೆನ್ನೈ - ಮುಂಬೈ',
        chennaiToKolkata: 'ಚೆನ್ನೈ - ಕಲ್‌ಕತ್ತಾ',
        chennaiToKochin: 'ಚೆನ್ನೈ - ಕೊಚ್ಚಿನ್',
        searchBus: 'ಬಸ್ ಹುಡುಕು',

        //filter search bus ui

        availableBusses: 'ಲಭ್ಯವಿರುವ ಬಸ್‌ಗಳು',
        theResultOfYourJourney: 'ನಿಮ್ಮ ಪ್ರಯಾಣದ ಫಲಿತಾಂಶ',
        filter: 'ಫಿಲ್ಟರ್',
        busType: 'ಬಸ್ ಪ್ರಕಾರ',
        travelsName: 'ಪ್ರಯಾಣಿಕರ ಹೆಸರು',
        from: 'ಎಲ್ಲಿಂದ',
        to: 'ಎಲ್ಲಿಗೆ',
        busType: 'ಬಸ್ ಪ್ರಕಾರ',
        availableFeatures: 'ಲಭ್ಯವಿರುವ ವಿಶೇಷಗಳು',
        fare: 'ವೆಚ್ಚ',
        seat: 'ಸೀಟು',
        action: 'ಕ್ರಿಯೆ',
        modify : 'ಬದಲಿಸಲು',
        general : 'ಸಾಮಾನ್ಯ',
        acSleeper : 'ಏಸಿ ಸ್ಲೀಪರ್',
        acSeater : 'ಏಸಿ ಸೀಟರ್',
        priceRange : 'ಬೆಲೆ ವಿಸ್ತರಣೆ',
        back : 'ಹಿಂದಿನಿಂದ',
        availablitySeats : 'ಲಭ್ಯತೆಯ ಆಸನಗಳು',



        addPassenger : 'ಯಾತ್ರಿಕರನ್ನು ಸೇರಿಸಿ',
        passenger : 'ಪ್ರಯಾಣಿಕ',
        pleaseSelectOneSeat : 'ದಯವಿಟ್ಟು ಒಂದು ಆಸನವನ್ನು ಆಯ್ಕೆಮಾಡಿ',
        booked : 'ಬುಕ್ ಮಾಡಲಾಗಿದೆ',
        available : 'ಲಭ್ಯವಿದೆ',
        driver : 'ಚಾಲಕ',
        back : 'ಹಿಂದಿನಿಂದ',
        name : 'ಹೆಸರು',
        age : 'ವಯಸ್ಸು',
        mobileNumber : 'ಮೊಬೈಲ್ ಸಂಖ್ಯೆ',
        gender : 'ಲಿಂಗ',
        bookNow : 'ಬುಕ್ ಮಾಡಿ',
        male : 'ಪುರುಷ',
        female : 'ಹೆಣ್ಣು',
        transgender : 'ಮಂಗಳಮುಖಿ',



        payment : 'ಪಾವತಿ',
        amount : 'ಮೊತ್ತ',
        gst : 'ಜಿಎಸ್ಟಿ',
        applyCouponCode : 'ಕೂಪನ್ ಕೊಡಿಯನ್ನು ಅನ್ವಯಿಸಿ',
        totalAmountNeedToPay : 'ಪಾವತಿ ಮಾಡಬೇಕಾದ ಒಟ್ಟು ಮೊತ್ತ',
        paymentType : 'ಪಾವತಿ ರೀತಿ',
        oneLineParaPayment : 'ಯದಿ ಪಾವತಿ ವಿಫಲವಾಗಿದ್ದರೆ, ಪಾವತಿ 30 ನಿಮಿಷಗಳ ಒಳಗಾಗಿ ನಿಷೇಧ ಅಥವಾ ನಿಷ್ಪತ್ತಿಯಾಗುತ್ತದೆ ಎಂದು ನೀವು support@autope.in ಗೆ ಸಂಪರ್ಕಿಸಬಹುದು',
        bookTicket : 'ಟಿಕೆಟ್ ಬುಕ್ ಮಾಡಿ',
        sorryForThisRoute : 'ಈ ರೂಟ್ ಗಳಿಗೆ ಕ್ಷಮಿಸಿ...',
        creditCard : 'ಕ್ರೆಡಿಟ್ ಕಾರ್ಡ್',
        debitCard : 'ಡೆಬಿಟ್ ಕಾರ್ಡ್',
        creditCardDetails : 'ಕ್ರೆಡಿಟ್ ಕಾರ್ಡ್ ವಿವರಗಳು',
        cardHolderName : 'ಕಾರ್ಡ್ ಹೋಲ್ಡರ್ ಹೆಸರು',
        cardNumber : 'ಕಾರ್ಡ್ ಸಂಖ್ಯೆ',
        monthAndYear : 'ತಿಂಗಳು ಮತ್ತು ವರ್ಷ',
        cvv : 'ಕಾರ್ಡ್ ಪರಿಶೀಲನೆ ಮೌಲ್ಯ',
        upiDetails : 'ಏಕೀಕೃತ ಪಾವತಿಗಳ ಇಂಟರ್ಫೇಸ್ ವಿವರಗಳು',
        upi : 'ಏಕೀಕೃತ ಪಾವತಿಗಳ ಇಂಟರ್ಫೇಸ್',

        //footer

        about : 'ಬಗ್ಗೆ',
        getInTouch : 'ಸಂಪರ್ಕದಲ್ಲಿರಲು',
        address : '8014 ಎಡಿತ್ Blvd NE, ಅಲ್ಬುಕರ್ಕ್, ನ್ಯೂಯಾರ್ಕ್, ಯುನೈಟೆಡ್ ಸ್ಟೇಟ್ಸ್',
        learnMore : 'ಇನ್ನಷ್ಟು ತಿಳಿಯಿರಿ',
        about : 'ಬಗ್ಗೆ',
        contact : 'ಸಂಪರ್ಕಿಸಿ',
        advertise : 'ಜಾಹೀರಾತು ಮಾಡಿ',
        termsOfService : 'ಸೇವಾ ನಿಯಮಗಳು',
        privacyPolicy : 'ಗೌಪ್ಯತಾ ನೀತಿ',
        ourNewsletter : 'ನಮ್ಮ ಸುದ್ದಿಪತ್ರ',
        subscribeMessage : 'ನಮ್ಮ ಸುದ್ದಿ ಮತ್ತು ರಿಯಾಯಿತಿಗಳನ್ನು ನಿಮಗೆ ತಲುಪಿಸಲು ನಮ್ಮ ಸುದ್ದಿಪತ್ರಕ್ಕೆ ಚಂದಾದಾರರಾಗಿ.',
        subscribe : 'ಚಂದಾದಾರರಾಗಿ',
        allRightsAreReserved : '2024. ಎಲ್ಲಾ ಹಕ್ಕುಗಳನ್ನು ಕಾಯ್ದಿರಿಸಲಾಗಿದೆ.',

    },
    ml : {

        //header

        busTicketBookingSystem : 'ബസ് ടിക്കറ്റ് ബുക്കിംഗ് സംവിധാനം',
        english : 'English',
        tamil : 'Tamil',
        kannada : 'Kannada',
        india : 'ഇന്ത്യ 🇮🇳',
        malayalam : 'മലയാളം',

        //Login Page Names

        makeYourJourneyPleasant: 'നിങ്ങളുടെ യാത്ര സുഖകരമാക്കുക',
        downloadOurAppForBetterExperience : 'മികച്ച അനുഭവത്തിനായി ഞങ്ങളുടെ ആപ്പ് ഡൗൺലോഡ് ചെയ്യുക',
        aPackagedTourToTheKanniyakumariToKashmir : 'കന്യാകുമാരി മുതൽ കാശ്മീർ വരെ ഒരു പാക്കേജ് ടൂർ',
        bookATicketsNow : 'ഇപ്പോൾ തന്നെ ടിക്കറ്റ് ബുക്ക് ചെയ്യുക',
        aLimitedSeatsAreAvailable : 'പരിമിതമായ സീറ്റുകൾ ലഭ്യമാണ്.',
        adminLogin : 'അഡ്മിൻ ലോഗിൻ',
        userLogin : 'ഉപയോക്തൃ ലോഗിൻ',
        userNameOrEmailPlaceholder : 'ഉപയോക്തൃനാമം അല്ലെങ്കിൽ ഇമെയിൽ',
        passwordPlaceHolder : 'Password',
        signIn : 'സൈൻ ഇൻ',
        trendingOffers : 'ട്രെൻഡിംഗ് ഓഫറുകൾ',

        //Admin Login Bus List Names

        listOfBus : 'ബസിൻ്റെ ലിസ്റ്റ്',
        toAddNewBus : 'പുതിയ ബസ് ചേർക്കാൻ',
        travelsName : 'യാത്രയുടെ പേര്',
        from : 'നിന്ന്',
        to : 'ലേക്ക്',
        busType : 'ബസ് തരം',
        availableFeatures : 'ലഭ്യമായ സവിശേഷതകൾ',
        fare : 'കൂലി',
        seat : 'ഇരിപ്പിടം',
        action : 'ആക്ഷൻ',
        addBus : 'ആഡ്ബസ്',
        logOut : 'പുറത്തുകടക്കുക',

        //search bus ui

        indiasNo1OnlineBusticketBookingSite : 'ഇന്ത്യയിലെ നമ്പർ.1 ഓൺലൈൻ ബസ് ടിക്കറ്റ് ബുക്കിംഗ് സൈറ്റ്',
        bookYourTicketsNow : 'നിങ്ങളുടെ ടിക്കറ്റുകൾ ഇപ്പോൾ ബുക്ക് ചെയ്യുക!',
        from : 'നിന്ന്',
        to : 'ലേക്ക്',
        departureDate : 'പുറപ്പെടുന്ന തീയതി',
        popularRoute : 'ജനപ്രിയ റൂട്ട്',
        chennaiToBangalore : 'ചെന്നൈ - ബെംഗളൂരു',
        chennaiToDelhi : 'ചെന്നൈ - ഡൽഹി',
        chennaiToMumbai : 'ചെന്നൈ - മുംബൈ',
        chennaiToKolkata : 'ചെന്നൈ - കൊൽക്കത്ത',
        chennaiToKochin : 'ചെന്നൈ - കൊച്ചി',
        searchBus : 'ബസിനായി തിരയുക',

        //filtered search bus ui

        availableBusses : 'ലഭ്യമായ ബസുകൾ',
        theResultOfYourJourney : 'നിങ്ങളുടെ യാത്രയുടെ ഫലം',
        filter : 'ഫിൽട്ടറുകൾ',
        busType : 'ബസ് തരം',
        availablitySeats : 'ലഭ്യമായ സീറ്റ്',
        travelsName : 'യാത്രയുടെ പേര്',
        from : 'നിന്ന്',
        to : 'ലേക്ക്',
        busType : 'Bus Type',
        availableFeatures : 'ലഭ്യമായ സവിശേഷതകൾ',
        fare : 'കൂലി',
        seat : 'ഇരിപ്പിടം',
        action : 'ആക്ഷൻ',
        modify : 'പരിഷ്ക്കരിക്കുക',
        general : 'ജനറൽ',
        acSleeper : 'എസി സ്ലീപ്പർ',
        acSeater : 'എസി സീറ്റർ',
        priceRange : 'വില പരിധി',
        back : 'തിരികെ',
        sorryForThisRoute : 'ക്ഷമിക്കണം ഈ റൂട്ടിൽ ബസുകളൊന്നും ലഭ്യമല്ല...',

        // Admin Login Edit Bus

        toEditBus : 'ബസ് എഡിറ്റ് ചെയ്യാൻ',
        EditBus : 'ബസ് എഡിറ്റ് ചെയ്യുക',
        back : 'തിരികെ',
        busName : 'ബസിൻ്റെ പേര്',
        from : 'നിന്ന്',
        to : 'ലേക്ക്',
        busType : 'ബസ് തരം',
        availableFeatures : 'ലഭ്യമായ സവിശേഷതകൾ',
        fare : 'കൂലി',
        chargingPoint : 'ചാർജിംഗ് പോയിൻ്റ്',
        wirelessFidelity : 'വയർലെസ് ഫിഡിലിറ്റി',
        dvd : '4k ഡിവിഡി',
        television : 'ടെലിവിഷൻ',
        waterBottle : 'വെള്ളകുപ്പി',
        pillow : 'തലയണ',
        readingLight : 'വായന വെളിച്ചം',

        //Passenger Details

        addPassenger : 'യാത്രക്കാരനെ ചേർക്കുക',
        passenger : 'യാത്രക്കാരൻ',
        pleaseSelectOneSeat : 'ദയവായി ഒരു സീറ്റ് തിരഞ്ഞെടുക്കുക',
        booked : 'ബുക്ക് ചെയ്തു',
        available : 'ലഭ്യമാണ്',
        driver : 'ഡ്രൈവർ',
        back : 'തിരികെ',
        name : 'പേര്',
        age : 'പ്രായം',
        gender : 'ലിംഗഭേദം',
        mobileNumber : 'മൊബൈൽ നമ്പർ',
        bookNow : 'ഇപ്പോൾ ഉറപ്പാക്കു',
        male : 'ആൺ',
        female : 'സ്ത്രീ',
        transgender : 'ട്രാൻസ്ജെൻഡർ',

        //Payment

        payment : 'പേയ്മെന്റ്',
        amount : 'തുക',
        gst : 'ജി.എസ്.ടി',
        applyCouponCode : 'കൂപ്പൺ കോഡ് പ്രയോഗിക്കുക',
        totalAmountNeedToPay : 'അടയ്‌ക്കേണ്ട ആകെ തുക',
        paymentType : 'പേയ്മെൻ്റ് തരം',
        oneLineParaPayment : '* ഇടപാട് പരാജയപ്പെടുകയാണെങ്കിൽ, ഇടപാട് കഴിഞ്ഞ് 30 മിനിറ്റിനുള്ളിൽ മാൻഡേറ്റ് റിലീസ് ചെയ്യപ്പെടും, അല്ലാത്തപക്ഷം നിങ്ങൾക്ക് support@autope.in എന്ന വിലാസത്തിൽ ഞങ്ങളെ ബന്ധപ്പെടാം.',
        bookTicket : 'ബുക്ക് ടിക്കറ്റ്',
        creditCard : 'ക്രെഡിറ്റ് കാർഡ്',
        debitCard : 'ഡെബിറ്റ് കാർഡ്',
        creditCardDetails : 'ക്രെഡിറ്റ് കാർഡ് വിശദാംശങ്ങൾ',
        cardHolderName : 'കാർഡ് ഉടമയുടെ പേര്',
        cardNumber : 'കാർഡ് നമ്പർ',
        monthAndYear : 'മാസവും വർഷവും',
        cvv : 'Cvv',
        upiDetails : 'UPI വിശദാംശങ്ങൾ',
        upi : 'ഉപി',

        //footer

        about : 'കുറിച്ച്',
        getInTouch : 'ബന്ധപ്പെടുക',
        address : '8014 Edith Blvd NE, Albuquerque, New York, United States',
        learnMore : 'കൂടുതലറിയുക',
        about : 'കുറിച്ച്',
        contact : 'ബന്ധപ്പെടുക',
        advertise : 'പരസ്യം ചെയ്യുക',
        termsOfService : 'സേവന നിബന്ധനകൾ',
        privacyPolicy : 'സ്വകാര്യതാ നയം',
        ourNewsletter : 'ഞങ്ങളുടെ വാർത്താക്കുറിപ്പ്',
        subscribeMessage : 'ഞങ്ങളുടെ വാർത്തകളും കിഴിവുകളും നിങ്ങൾക്ക് എത്തിക്കുന്നതിന് ഞങ്ങളുടെ വാർത്താക്കുറിപ്പ് സബ്‌സ്‌ക്രൈബ് ചെയ്യുക.',
        subscribe : 'സബ്സ്ക്രൈബ് ചെയ്യുക',
        allRightsAreReserved : '2024. എല്ലാ അവകാശങ്ങളും നിക്ഷിപ്തം.',

    }
};

export default messages;